{
  "title": "FIA: Fluorescence Image Aligner - Dual-Engine Motion Correction for ImageJ/Fiji (v3.0.0)",
  "description": "<p><strong>FIA (Fluorescence Image Aligner) v3.0.0</strong> is a major milestone release introducing a revolutionary <strong>Dual-Engine Architecture</strong> for robust motion correction in fluorescence microscopy. This version bridges the gap between high-precision rigid alignment and robust large-displacement stabilization.</p><p><strong>v3.0.0 Highlights: The \"Dual-Engine\" Update</strong><br>This release integrates two powerful registration kernels into a unified, smart interface, allowing users to tackle everything from subtle sub-pixel jitter to severe sample drift and deformation.</p><p><strong>Key Features:</strong></p><ul><li><strong>🚀 Dual-Engine Architecture:</strong><ul><li><strong>OpenCV ECC (Default):</strong> Provides sub-pixel precision for rigid body transformations (Translation/Euclidean/Affine), ideal for high-quality functional imaging data.</li><li><strong>Legacy Stabilizer (New):</strong> A full Java port of the classic Lucas-Kanade algorithm (based on Kang Li's Image Stabilizer). It offers superior robustness against large displacements where gradient-based methods might fail.</li></ul></li><li><strong>🌊 Elastic Registration (New):</strong> Introduces a dense <strong>Optical Flow (Farneback)</strong> mode to correct non-rigid deformations, such as tissue growth, squashing, or complex biological warping.</li><li><strong>⚓ Dynamic Anchor Strategy:</strong> Implements a \"What You See Is What You Anchor\" philosophy. Users can now set the alignment reference to the <strong>currently viewed frame</strong> (e.g., Frame 50), automatically registering past and future frames to this optimal timepoint.</li><li><strong>🧠 Smart UI & Workflow:</strong><ul><li><strong>Context-Aware Interface:</strong> Parameter panels automatically hide/show based on the selected engine and mode to reduce clutter.</li><li><strong>Biosensor Tool Integration:</strong> Now organized under the standardized <code>Biosensor Tool</code> menu for better discoverability.</li><li><strong>Rolling Reference:</strong> The Legacy engine supports a customizable update coefficient (default 0.90) for smooth, steady-cam style stabilization.</li></ul></li><li><strong>🛡️ Non-Destructive & Quantitative:</strong> Continues to prioritize data integrity by generating new stacks without altering raw files, and offers CSV export of transformation matrices for trajectory analysis.</li></ul>",
  "creators": [
    {
      "name": "Wang, Kui",
      "affiliation": "Center for Excellence in Brain Science and Intelligence Technology (Institute of Neuroscience), Chinese Academy of Sciences",
      "orcid": "0000-0002-9436-3632"
    }
  ],
  "access_right": "open",
  "license": "MIT",
  "version": "3.0.0",
  "keywords": [
    "imagej",
    "fiji",
    "imagej-plugin",
    "scientific-software",
    "bioimage-analysis",
    "image-registration",
    "motion-correction",
    "dual-engine",
    "opencv",
    "legacy-stabilizer",
    "optical-flow",
    "elastic-registration",
    "lucas-kanade",
    "calcium-imaging",
    "fluorescence-microscopy"
  ],
  "upload_type": "software",
  "related_identifiers": [
    {
      "relation": "isSupplementTo",
      "identifier": "https://github.com/Epivitae/FIA-Fluorescence-Image-Aligner"
    }
  ]
}